In [1]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import text 
import  pymysql.cursors
cnn= pymysql.connect(host='localhost',     #IP
                             user='root',  #用户名
                             password='deepwind',  #密码
                             port=3306,  #端口号
                             charset='utf8')#注意是utf8不是utf-8 
# 使用cursor()方法获取操作游标 
cursor = cnn.cursor()
# 使用execute方法执行SQL语句
cursor.execute("SELECT VERSION()")
result = cursor.fetchone()
print ("Database version : %s " % result)

Database version : 8.0.15


* 控制函数：
* 1、case when
* case 开始，end 结束；
* when 可以有多条，根据你的条件判断的内容
* else 不是必须的，可选；when 中各种情况 下一条件 之外概括
* 2、if

# 已经在mysql里创建了db_order 和表
show databases;
use db_order;
create table hy_order_20170410 (id varchar(100),order_money float,memeber_id
int,create_time datetime,status int);
insert into hy_order_20170410 values ('A001',100.15,1,'2017-01-01 13:23:12',2);
insert into hy_order_20170410 values ('A001',100.15,1,'2017-01-01 13:23:12',2);
insert into hy_order_20170410 values ('A002',100.0,2,'2017-04-01 14:23:12',2);
insert into hy_order_20170410 values ('A003',12.1,3,'2017-01-01 13:23:12',2);
insert into hy_order_20170410 values ('A004',200.15,4,'2017-01-01 13:23:12',2);
insert into hy_order_20170410 values ('A005',1200.15,5,'2017-01-01 13:23:12',2);
insert into hy_order_20170410 values ('A006',0.15,11,'2017-01-01 17:23:12',2);
insert into hy_order_20170410 values ('A007',1215.1,31,'2017-01-01 10:23:12',2);
insert into hy_order_20170410 values ('A008',100.75,15,'2017-01-01 14:23:12',2);
insert into hy_order_20170410 values ('A009',100.15,8,'2017-01-01 15:23:12',2);
insert into hy_order_20170410 values ('A010',20.15,9,'2017-01-01 16:23:12',2);
insert into hy_order_20170410 values ('A011',110.15,21,'2017-01-01 14:23:12',2);
insert into hy_order_20170410 values ('A012',1.15,13,'2017-01-01 13:03:12',2);
insert into hy_order_20170410 values ('A013',20.15,14,'2017-02-01 13:53:12',2);
insert into hy_order_20170410 values ('A014',30.15,15,'2017-03-01 13:23:12',2);
insert into hy_order_20170410 values ('A015',40.5,13,'2017-01-01 13:23:12',2);
insert into hy_order_20170410 values ('A016',65.0,1,'2016-01-01 13:23:12',2);
insert into hy_order_20170410 values ('A017',78.15,1,'2016-03-01 09:23:12',1);
insert into hy_order_20170410 values ('A018',88.15,1,'2016-11-01 20:23:12',2);
insert into hy_order_20170410 values ('A019',99.0,12,'2017-02-11 13:23:12',1);
insert into hy_order_20170410 values ('A020',10.3,13,'2017-04-01 13:23:12',2);
#创建订单明细表
create table hy_orderitem_20170410 (id varchar(100),order_id varchar(100),item_id
int,item_name varchar(200), price float,item_num int);
insert into hy_orderitem_20170410 values('AB001','A001',1001,'A',0.15,1);
insert into hy_orderitem_20170410 values('AB002','A001',1002,'B',20,1);
insert into hy_orderitem_20170410 values('AB003','A001',1003,'C',40,2);
insert into hy_orderitem_20170410 values('AB004','A005',1001,'A',0.15,1);
insert into hy_orderitem_20170410 values('AB005','A005',1004,'D',200,6);
insert into hy_orderitem_20170410 values('AB0015','A015',1005,'E',40.5,1);
insert into hy_orderitem_20170410 values('AB0016','A019',1006,'F',50,1);
insert into hy_orderitem_20170410 values('AB0017','A019',1007,'G',24.5,2);
insert into hy_orderitem_20170410 values('AB0018','A020',1008,'H',10.3,1);

In [2]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import text 
import  pymysql.cursors
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/db_order')
db = pymysql.connect("localhost","root","deepwind","db_order" ) #,"TESTDB" 
sql = " select * from db_order.hy_order_20170410 where order_money>100;" 
df = pd.read_sql_query(sql, engine)
df.head()
# 使用 cursor() 方法创建一个游标对象 cursor
#cursor = db.cursor()
# 使用 execute() 方法执行 SQL，如果表存在则删除
#cursor.execute(sql)
#result = cursor.fetchone()
#print ('databases: %s ' % result)
#db.close()
#print(result)

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

     id  order_money  memeber_id         create_time  status
0  A001       100.15           1 2017-01-01 13:23:12       2
1  A001       100.15           1 2017-01-01 13:23:12       2
2  A004       200.15           4 2017-01-01 13:23:12       2
3  A005      1200.15           5 2017-01-01 13:23:12       2
4  A007      1215.10          31 2017-01-01 10:23:12       2

In [4]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import text 
import  pymysql.cursors
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/db_order')
db = pymysql.connect("localhost","root","deepwind","db_order" ) #,"TESTDB" 
sql = '''
select id,order_money,
case when order_money<=50 then '低'
    when order_money>50 and order_money<=100 then '中' else '高'
end as c_type,
case when order_money<=50 then '低'
when order_money>50 and order_money<=100 then '中'
when order_money>100 then '高'
else '其它'
end as c1_type,
case when order_money<=50 then '低'
when order_money>50 and order_money<=100 then '中'
when order_money>100 then '高'
end as c1_type
from db_order.hy_order_20170410;''' 
df = pd.read_sql_query(sql, engine)
df.head()

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

     id  order_money c_type c1_type c1_type
0  A001       100.15      高       高       高
1  A001       100.15      高       高       高
2  A002       100.00      中       中       中
3  A003        12.10      低       低       低
4  A004       200.15      高       高       高

/*
* if 如果某个条件成立 ，则选择第二个参数 ，否则就用第三个参数
* 用 IF 嵌套实现 case when 的内容，分成高，中，低
* */

In [8]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import text 
import  pymysql.cursors
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/db_order')
db = pymysql.connect("localhost","root","deepwind","db_order" ) #,"TESTDB" 
sql = '''
select id
 ,order_money
,if(order_money>=100,'high','low') as c_type
,if(order_money>100,if(order_money>200,'高','中'),'低') as c_type2
from db_order.hy_order_20170410;'''
df = pd.read_sql_query(sql, engine)
df.head()

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

     id  order_money c_type c_type2
0  A001       100.15   high       中
1  A001       100.15   high       中
2  A002       100.00   high       低
3  A003        12.10    low       低
4  A004       200.15   high       高